Revit 2027 API
DirectShapeType.GetOptions Method
 Gets a copy of the current options for this DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeTypeOptions GetOptions()
Public Function GetOptions As DirectShapeTypeOptions
public:
DirectShapeTypeOptions^ GetOptions()
member GetOptions : unit -> DirectShapeTypeOptions
Return Value
DirectShapeTypeOptions
 Options currently set for this DirectShapeType.
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace